Repository: Vincenzo1968/myoptParser
Catalog: po/*.po
Languages: it

source: Invalid call myopt_AddGroup(%s): argument 'parser' is NULL
it: Chiamata non valida alla funzione myopt_AddGroup(%s): l'argomento 'parser' è NULL

source: Error: must be specified at least one of shortName and longName
it: Errore: deve essere specificato almeno uno tra shortName e longName

source: Invalid call myopt_AddOption(%s): argument 'parser' is NULL
it: Chiamata non valida alla funzione myopt_AddOption(%s): l'argomento 'parser' è NULL

source: Invalid call myopt_AddOption(%s): idGroup %d not valid.
it: Chiamata non valida alla funzione myopt_AddOption(%s): idGroup %d non è valido.

source: Invalid call myopt_AddOption(%s): must be specified one of shortName and longName
it: Chiamata non valida alla funzione myopt_AddOption(%s): deve essere specificato uno tra shortName e longName

source: Invalid call myopt_AddOption(%s): the option is already present in the symbol table
it: Chiamata non valida alla funzione myopt_AddOption(%s): l'opzione è già presente nella tabella dei simboli

source: '%s': wrong type spec: '%s' in strTypes '%s'
it: '%s': tipo non valido: '%s' in strTypes '%s'

source: Arguments for option '
it: Argomenti per l'opzione

source: zero or more
it: zero o più

source: one or more
it: uno o più

source: %d or more
it: %d o più

source: between %d and %d
it: tra %d e %d

source: exactly %d
it: esattamente %d

source: Usage:
it: Uso:

source: Options
it: Opzioni

source: (zero or more)
it: (zero o più)

source: (one or more)
it: (uno o più)

source: (%d or more)
it: (%d o più)

source: (between %d and %d)
it: (tra %d e %d)

source: (exactly %d)
it: (esattamente %d)

source: Options:
it: Opzioni:

source: Group[%d]: %s:
it: Gruppo[%d]: %s

source: Only one of:
it: Soltanto una di:

source: At least one of:
it: Almeno una di:

source: (required)
it: (obbligatoria)

source: (optional)
it: (opzionale)

source: Error: multiple occurrences(%d) of '%s' option.
it: Errore: occorrenze multiple(%d) dell'opzione '%s'.

source: Error: option %s: wrong number of arguments: must be %d; found %d.
it: Errore: opzione %s: numero di argomenti errato: deve essere %d; trovato %d.

source: Error: option %s: wrong number of arguments: must be between %d and %d; found %d.
it: Errore: opzione %s: numero di argomenti errato: deve essere tra %d e %d; trovato %d.

source: Error: option '-%c --%s' is required.
it: Errore: l'opzione '-%c --%s' è obbligatoria.

source: Error: must be present at least one option of group %d '%s'.
it: Errore: deve essere presente almeno un'opzione del gruppo %d '%s'.

source: Error: there is more than one option for the mutually exclusive group %d '%s'. It is allowed only one.
it: Errore: è stata specificata più di un'opzione per il gruppo %d '%s'. Ne è permessa soltanto una.

source: Error: wrong number of positional arguments: must be %d; found %d.
it: Errore: numero errato di argomenti posizionali: deve essere %d; trovato %d.

source: Error: wrong number of positional arguments: must be between %d and %d; found %d.
it: Errore: numero errato di argomenti posizionali: deve essere tra %d e %d; trovato %d.

source: Error: wrong number of positional arguments: must be at least %d; found %d.
it: Errore: numero errato di argomenti posizionali: deve essere almeno %d; trovato %d.

source: Error: option %s: wrong number of arguments: must be almost %d; found %d.
it: Errore: opzione %s: numero errato di argomenti: deve essere almeno %d; trovato %d.

source: Error: multiple occurrences of '--'.
it: Errore: occorrenze multiple di '--'.

source: Error: unexpected token.
it: Errore: token inaspettato.

source: Error: positional argument %d wrong type. Must be %s; found %s: '%s'
it: Errore: tipo dell'argomento posizionale %d errato. Deve essere %s; trovato %s: '%s'

source: Error: option '%s': argument %d wrong type. Must be %s; found %s: '%s'
it: Errore: opzione '%s': specificato un tipo errato per l'argomento %d. Deve essere %s; trovato %s: '%s'

source: Error: wrong option '-'
it: Errore: opzione non valida '-'

source: Error: option '%s': there must be no spaces before and after the equal sign
it: Errore: opzione '%s': Non ci devono essere spazi prima e dopo il segno di uguale

source: Error: unrecognized option '%s'
it: Errore: opzione non riconosciuta '%s'

source: Error: unrecognized option '-%c'
it: Errore: opzione non riconosciuta '-%c'
